EDT/MPCurier/src/Documents/УстановкаСтатусовЗаказовПрочее/УстановкаСтатусовЗаказовПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусовЗаказовПрочее</name>
  <registerRecords>InformationRegister.СтатусыЗаказов</registerRecords>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленВЦУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>CatalogRef.Заказы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>CatalogRef.РезультатыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказаПереноса</name>
      <type>
        <types>CatalogRef.ПричиныОтказаПереноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПереносаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/MPCurier/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереносаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусУстановленВЦУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/MPCurier/src/Documents/УстановкаСтатусовЗаказовПрочее/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусыЗаказов
	Движения.СтатусыЗаказов.Записывать = Истина;
	Для Каждого ТекЗаказ Из Заказы Цикл
		Движение = Движения.СтатусыЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = ТекЗаказ.Заказ;
		Движение.Рейс = Рейс;
		Движение.РезультатДоставки = ТекЗаказ.СтатусДоставки;
		Движение.ПричинаОтказаПереноса = ТекЗаказ.ПричинаОтказаПереноса;
		Движение.ДатаПереносаДоставки = ТекЗаказ.ДатаПереносаДоставки;
		Движение.СтатусУстановленВЦУ = СтатусУстановленВЦУ;
	КонецЦикла	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ	
КонецПроцедуры
#КонецОбласти
